Revit 2024 API
BuiltInFailures.GeneralFailures.ParameterValueNotInRange Property
 The value for [Parameter Name] must be between [Value] and [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ParameterValueNotInRange { get; }
Visual Basic
Public Shared ReadOnly Property ParameterValueNotInRange As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ParameterValueNotInRange {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace